Revit 2026 API

# PowerFactorStateType Enumeration

---

An enumerated type listing all the possible power factor state types for a connector object.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PowerFactorStateType
```
```vb
Public Enumeration PowerFactorStateType
```
```cpp
public enum class PowerFactorStateType
```
```fsharp
type PowerFactorStateType
```

| Member name | Value | Description |
| --- | --- | --- |
| Lagging | 1 | Power FactorState Type is Lagging. |
| Leading | 0 | Power FactorState Type is Leading. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace